[
  {
    "path": "lecciones_nutricion/2023-12-13-magnesio-y-funcin-cerebral/",
    "title": "Magnesio y función cerebral",
    "description": "Trataremos en esta publicación, sobre la función del magnesio en la neuroplasticidad y su potencial efecto en el mantenimiento y mejoramiento de la memoria y la capacidad de aprendizaje.",
    "author": [
      {
        "name": "Félix R. Millán-Trujillo",
        "url": {}
      }
    ],
    "date": "2023-12-13",
    "categories": [
      "Magnesio",
      "Cerebro",
      "Cognición",
      "Memoria",
      "Sinápsis"
    ],
    "contents": "\n\nContents\nMemoria y aprendizaje\nEl Magnesio en la neuroquímica\nL-Treonato de Magnesio (MgT)\nLectura complementaria\n\n\nMemoria y aprendizaje\nLa fortaleza de las conexiones sinápticas, está ampliamente asociada con la función cerebral de la memoria, y algunas investigaciones también la asocian con la capacidad de aprendizaje. Sin embargo, la habilidad cerebral para almacenar nueva información, parece estar correlacionada con la plasticidad de las conexiones neuronales y el número de conexiones disponibles.\nPor lo tanto, debe existir un número crítico de conexiones para que tenga lugar las funciones cerebrales de memoria y aprendizaje. De hecho, en experimentos con animales se ha demostrado la correlación entre la disminución de conexiones neuronales y la disminución de la memoria asociada al envejecimiento.\nSi bien la edad es un factor irreversible, la dieta y los factores ambientales son factores susceptibles de modificación, que desempeñan un rol fundamental en el diseño de estrategias enfocadas hacia el modelado de la capacidad cognitiva del cerebro.\nEl Magnesio en la neuroquímica\nEl Magnesio (\\(Mg^{2+}\\)) es el cuarto ión más abundante en el cuerpo humano y actúa como grupo prostético o cofactor en más de 300 reacciones enzimáticas, siendo esencial para el funcionamiento del sistema cardiovascular, la contracción muscular y el sistema nervioso.\n\n\n\nEn el cerebro, una de las funciones fundamentales del \\(Mg^{2+}\\), es la regulación de los receptores NMDA (NMDAR) localizados en las terminaciones sinápticas, donde desempeñan su función como moduladores del potencial excitatorio postsináptico. Estos receptores son voltaje-dependientes y el \\(Mg^{2+}\\) controla su apertura, lo cual resulta esencial para la plasticidad neuronal. Los estudios in vitro demuestran que el \\(Mg^{2+}\\) es un regulador positivo de la plasticidad neuronal; es decir, el incremento en la concentración de Magnesio en el fluido extracelular \\([Mg^{2+}]_o\\), dentro de un rango fisiológico, se relaciona con el aumento de la plasticidad neuronal en cultivos neuronales provenientes del hipocampo.\nEntiéndase por plasticidad neuronal o neuroplasticidad, la capacidad del cerebro para adaptarse a los cambios del entorno.\nLa concentración de \\(Mg^{2+}\\) es mayor en el fluido cerebro espinal que en plasma, y este gradiente se mantiene por un proceso de transporte activo que regula la cantidad de Magnesio en el cerebro. De hecho, la elevación de la concentración de \\(Mg^{2+}\\) en plasma a través del suministro de \\(MgSo_4\\) por vía endovenosa, solo ha logrado incrementar la concentración de magnesio en el cerebro entre 10%-19%.\nL-Treonato de Magnesio (MgT)\nEl MgT es una estructura química que aumenta la biodisponibilidad del Magnesio, pudiendo, de esa manera, incrementar la concentración de \\(Mg^{2+}\\) en el cerebro, mediante la suplementación oral, tal como se ha demostrado en animales de experimentación; en los cuales, el tratamiento crónico con MgT ha permitido la formación de nuevas conexiones neuronales en el corto tiempo y su fortalecimiento en el largo plazo. Ambos, procesos de suma importancia para la memoria y el aprendizaje.\n\n\n\nA nivel celular, la elevación de los niveles de \\(Mg^{2+}\\) en el cerebro, secundarios a la administración crónica de MgT, se relaciona con la reconfiguración de las redes sinápticas en animales, pasando de pocas conexiones con alta probabilidad de desconexión, a numerosas conexiones de baja probabilidad de desconexión.\nPuede especularse que estas modificaciones en la neuroquímica a partir de la dieta y la suplementación oral con MgT, pudieran tener un efecto positivo en las funciones cerebrales de la memoria y el aprendizaje; aunque se requiere más investigación al respecto.\nA través de la dieta, las principales fuentes de \\(Mg^{2+}\\) son los cereales fortificados, legumbres, vegetales de hojas verdes como la espinaca, la leche y el yogurt. Las cantidades recomendadas por día, en miligramos (mg), son: 310-320 mg en mujeres y 400-420 mg en hombres. de acuerdo a las Recommended Dietary Allowanses (RDA)\nLectura complementaria\nInna S., Nashat A., Long-Jun W., Chao H., Ling Z., Bo L., Xiang Z., Arvind G., Ming-Gao Z., Min Z., Susumo T., Guosong L. Enhancement of Learning and Memory by Elevating Brain Magnesium. Neuron (2010). N°65. Pp., 165-177.\n\n\n\n",
    "preview": "lecciones_nutricion/2023-12-13-magnesio-y-funcin-cerebral/Mg.png",
    "last_modified": "2023-12-13T18:12:26-04:00",
    "input_file": {},
    "preview_width": 810,
    "preview_height": 569
  },
  {
    "path": "lecciones_nutricion/2023-07-11-mucina-como-fuente-de-fibra-endgena/",
    "title": "Mucina como fuente de fibra endógena",
    "description": "Se aborda una visión breve del impacto del ayuno intermitente en el microbioma intestinal, y la utilización de los O-Glucanos de la Mucina como fuente de fibra endógena y sustrato de fermentación, para la síntesis de ácidos grasos de cadena corta y su importancia en la salud humana.",
    "author": [
      {
        "name": "Félix R. Millán-Trujillo",
        "url": {}
      }
    ],
    "date": "2023-07-11",
    "categories": [
      "Mucina",
      "Intestino",
      "Ayuno intermitente",
      "Ácido butírico"
    ],
    "contents": "\n\nContents\nMucina\nLectura complementaria\n\n\n\nMucina\nLa Mucina es la secreción mucosa producida por las células Globet del epitelio intestinal y el estómago, así como por las glándulas salivales. Está conformada principalmente por glucoproteínas que poseen en su estructura molecular O-Glucanos. Estos son polísacáridos ramificados compuestos principalmente por N-Acetilglucosamina, N-acetilgalactosamina (GlcNAc), galactosa y restos de fucosa, ácido siálico y carbohidratos azufrados.\nSe han identificado dos aspectos de importancia fisiológica con respecto a la Mucina: en primer lugar, actúa como barrera protectora del epitelio intestinal y gástrico; en segundo lugar, es un factor determinante de la homeostasis entre el huésped y la microbiota intestinal. Si bien la Mucina es resistente al proceso digestivo en el intestino delgado, bajo condiciones de ayuno, puede ser utilizada parcialmente como sustrato de fermentación en el colon.\nEs conocido que las dietas ricas en fibra dietética y almidones resistentes, promueven la fermentación microbiana en el intestino y la síntesis de ácidos grasos de cadena corta (SCFAs por sus siglas en inglés). Estos ácidos promueven una variedad de funciones fisiológicas: pueden actuar como fuente de energía en las células del intestino, activan directamente los receptores celulares de proteína G (GPCRs), regulan la expresión de citoquinas en las células T y contribuyen a su regulación.\nEn animales de experimentación, se ha encontrado la presencia de SCFAs en concentraciones entre 30-60 mM, en ratas alimentadas con dietas ricas en fibra, así como en animales alimentados con dietas libres de fibra dietaria. Estos resultados han sido corroborados en estudios con seres humanos sometidos a ayuno voluntario durante cortos periodos de tiempo. Esto sugiere que los O-Glucanos de la Mucina constituyen una fuente de fibra endógena y una alternativa metabólica ante la ausencia de carbohidratos no digeribles de la dieta.\nLa evidencia científica indica que ante condiciones de ayuno moderado, los O-Glucanos de la Mucina promueven cambios en las poblaciones microbianas del microbioma intestinal humano, favoreciendo la presencia de especies del género Lachnospiraceae, Bacteroides thetaiotaomicron y Akkermancia muciniphila. Estos microorganismos sintetizan una variedad de enzimas involucradas en la hidrólisis de los O-Glucanos de la Mucina. Especies bacterianas como Anaerotruncus colihominis y otras especies, también poseen los mecanismos enzimáticos capaces de utilizar la Mucina como sustrato energético. Microorganismos como R faecis y otras especies identificadas en humanos y animales, son productoras de ácido butírico (SCFAs) a partir de los O-Glucanos. Estos datos indican que , bajo condiciones de ayuno moderado, la utilización metabólica de la Mucina, requiere la conformación de un consorcio bacteriano muy diverso.\nLos SCFAs: acetato, propionato y butirato están constituidos por 4-6 átomos de carbono y son la principal fuente de combustible de la mucosa del colon e impactan de manera positiva la circulación mesentérica y la motilidad intestinal. Su ausencia está asociada con la atrofia de la mucosa colónica y la disminución de la inmunidad intestinal. A continuación se muestra la estructura química empírica y el modelo tridimensional del ácido butírico:\n\n\n\n\n\n\nLa biosíntesis de los SCFAs por las especies microbianas citadas con anterioridad, se produce por la ruta metabólica Embden-Meyerof de la glucólisis anaerobia.\nRuta metabólica Embden-Meyerof para la biosíntesis de SCFAsLa importancia de estos cambios en el microbioma intestinal, inducidos por periodos intermitentes de ayuno, radica en la producción de SCFAs y su influencia en la actividad inmunológica del cuerpo humano, tanto en la preservación de la inmunidad intestinal como en la participación en el eje intestino-cerebro, como agente neuroquímico involucrado en los mecanismos de regulación del apetito. Además de contribuir a regular la actividad celular de los Linfocitos T, los ácidos grasos de cadena corta y especialmente el Butirato, aceleran el metabolismo de los Linfocitos B y regulan la expresión genética que promueve la diferenciación de estas células.\n\n\nLectura complementaria\nHino S., Mizushima T., Kaneko K., Kawai E., Kondo T., Genda T., Yamada T., Hase K., Nishimura N., Morita T. Mucin-Derived O-Glycans Act as Endogenous Fiber and Sustain Mucosal Immune Homeostasis Via Short-Chain Fatty Acid Production in Rat Cecum. Journal of Nutrition (2020);150:2656-2665.\nReilly K.J., Rombeau J.L. Metabolism and potencial clinical applications of short-chain fatty acids. Clinical Nutrition (1993); 12 (Suppl 1): S97-S105.\nSu J., Wang Y., Zhang X., Ma M., Xie Z., Pan Q., Ma Z., Peppelenbosch M.P. Remodeling of the gut microbiome during Ramadam-associated intermittent fasting. American Journal of Clinical Nutrition (2021);113:1332-1342.\n\n\nVolver al principio\n\n\n\n\n",
    "preview": "lecciones_nutricion/2023-07-11-mucina-como-fuente-de-fibra-endgena/butirato3D.png",
    "last_modified": "2023-12-11T14:14:38-04:00",
    "input_file": {},
    "preview_width": 558,
    "preview_height": 315
  }
]
